spec.org
#+title: PLN CDR draft: spec
#+author: Gleefre
#+email: varedif.a.s@gmail.com

#+options: toc:nil
#+latex_header: \usepackage[margin=1in]{geometry}

* Introduction
  This is a specification for the =Package-Local Nicknames= extension in Common Lisp.
** Rationale
   Package-local nicknames make it possible to use short and easy-to-use names
   without potentially introducing name conflicts as can happen with usual nicknames.
** Current state
   Package-local nicknames are implemented in some form in =SBCL=, =CCL=, =ECL=,
   =Clasp=, =ABCL=, =Allegro CL=, =LispWorks=. There is also a pending MR for the
   =CLISP= implementation.

   Unfortunately, there are multiple inconsistencies between implementations. All of
   them lose /print-read consistency/ to some extent, and there are multiple edge
   cases that aren't always implemented correctly or in the same way.
** Goal
   The purpose of this document is to standardize the =Package-Local Nicknames=
   extension and to address some existing issues.

   [TODO] This CDR also aims to provide an extensive test suite for the extension.
* Description
  A /package-local nickname/ (or a /local nickname/) defined in some /designated
  package/ has the same effects as a usual /package nickname/ (later referred to as a
  /global nickname/), except that these effects only apply when ~*package*~ is bound
  to that /designated package/.

  This means that a call to ~find-package~ with a /local nickname/ that is defined in
  the /current package/ returns the package nicknamed by this nickname. This also
  affects all implied calls to ~find-package~, including those performed by the Lisp
  reader.

  In addition, to maintain /print-read consistency/, the Lisp printer is affected by
  /local nicknames/ defined in the /current package/.  For details see [[#issue-2][Issue 2]].

  A /local nickname/ is allowed to shadow a /package name/ or a /global nickname/,
  except for the names ~#:CL~, ~#:COMMON-LISP~ and ~#:KEYWORD~ which must always
  refer to their packages. The consequences of adding /local nicknames/ to the
  packages ~#:COMMON-LISP~ and ~#:KEYWORD~ are also undefined.
* API
** defpackage
   :PROPERTIES:
   :CUSTOM_ID: defpackage
   :END:
*** Description
    The ~defpackage~ options are extended to include the /local-nicknames-option/:
    : local-nicknames-option ::= (:local-nicknames (nickname package)*)

    Each pair specifies a /local nickname/ ~nickname~ for the corresponding ~package~.

    This option may appear more than once.
*** Arguments and Values:
    ~nickname~ --- a /string designator/.

    ~package~ --- a /package designator/.
*** Exceptional situations
    An error of type /package-error/ is signaled when a package designated by the
    ~package~ does not exists.

    Name conflict errors are handled by the underlying calls to
    ~make-package~ and ~add-package-local-nickname~.
*** Implementation dependent
    The consequences are undefined when a /local nickname/ is specified for thex
    package that is being defined. (See [[#issue-4][Issue 4]].)

    The consequences are undefined when supplied /local nicknames/ are at variance
    with the current state of the package. An implementation might choose to remove
    all existing /local nicknames/ at the beginning of each redefinition of the
    package.
** make-package
   :PROPERTIES:
   :CUSTOM_ID: make-package
   :END:
*** Description
    (*Contains proposals*: see [[#issue-6][Issue 6]].)

    The ~make-package~ lambda list is extended to include an additional keyword
    argument ~:local-nicknames~:
    : local-nicknames ::= ((nickname package)*)

    ~local-nicknames~ specifies zero or more /local nicknames/ to be defined in the
    new /package/.
