export/spec.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-06 Sat 13:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PLN CDR draft: spec</title>
<meta name="author" content="Gleefre" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">PLN CDR draft: spec</h1>

<div id="outline-container-org86efea9" class="outline-2">
<h2 id="org86efea9"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a specification for the <code>Package-Local Nicknames</code> extension in Common Lisp.
</p>
</div>
<div id="outline-container-orgb83271d" class="outline-3">
<h3 id="orgb83271d"><span class="section-number-3">1.1.</span> Rationale</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Package-local nicknames make it possible to use short and easy-to-use names
without potentially introducing name conflicts as can happen with usual nicknames.
</p>
</div>
</div>
<div id="outline-container-org9f1db7c" class="outline-3">
<h3 id="org9f1db7c"><span class="section-number-3">1.2.</span> Current state</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Package-local nicknames are implemented in some form in <code>SBCL</code>, <code>CCL</code>, <code>ECL</code>,
<code>Clasp</code>, <code>ABCL</code>, <code>Allegro CL</code>, <code>LispWorks</code>. There is also a pending MR for the
<code>CLISP</code> implementation.
</p>

<p>
Unfortunately, there are multiple inconsistencies between implementations. All of
them lose <i>print-read consistency</i> to some extent, and there are multiple edge
cases that aren't always implemented correctly or in the same way.
</p>
</div>
</div>
<div id="outline-container-org6ccfd8d" class="outline-3">
<h3 id="org6ccfd8d"><span class="section-number-3">1.3.</span> Goal</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The purpose of this document is to standardize the <code>Package-Local Nicknames</code>
extension and to address some existing issues.
</p>

<p>
[TODO] This CDR also aims to provide an extensive test suite for the extension.
</p>
</div>
</div>
</div>
<div id="outline-container-orge353844" class="outline-2">
<h2 id="orge353844"><span class="section-number-2">2.</span> Description</h2>
<div class="outline-text-2" id="text-2">
<p>
A <i>package-local nickname</i> (or a <i>local nickname</i>) defined in some <i>designated
package</i> has the same effects as a usual <i>package nickname</i> (later referred to as a
<i>global nickname</i>), except that these effects only apply when <code>*package*</code> is bound
to that <i>designated package</i>.
</p>

<p>
This means that a call to <code>find-package</code> with a <i>local nickname</i> that is defined in
the <i>current package</i> returns the package nicknamed by this nickname. This also
affects all implied calls to <code>find-package</code>, including those performed by the Lisp
reader.
</p>

<p>
In addition, to maintain <i>print-read consistency</i>, the Lisp printer is affected by
<i>local nicknames</i> defined in the <i>current package</i>.  For details see Issue 2.
</p>

<p>
A <i>local nickname</i> is allowed to shadow a <i>package name</i> or a <i>global nickname</i>,
except for the names <code>#:CL</code>, <code>#:COMMON-LISP</code> and <code>#:KEYWORD</code> which must always
refer to their packages. The consequences of adding <i>local nicknames</i> to the
packages <code>#:COMMON-LISP</code> and <code>#:KEYWORD</code> are also undefined.
</p>
</div>
</div>
<div id="outline-container-orge571498" class="outline-2">
<h2 id="orge571498"><span class="section-number-2">3.</span> API</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-defpackage" class="outline-3">
<h3 id="defpackage"><span class="section-number-3">3.1.</span> defpackage</h3>
<div class="outline-text-3" id="text-defpackage">
</div>
<div id="outline-container-orgee8e00e" class="outline-4">
<h4 id="orgee8e00e"><span class="section-number-4">3.1.1.</span> Description</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The <code>defpackage</code> options are extended to include the <i>local-nicknames-option</i>:
</p>
<pre class="example">
local-nicknames-option ::= (:local-nicknames (nickname package)*)
</pre>


<p>
Each pair specifies a <i>local nickname</i> <code>nickname</code> for the corresponding <code>package</code>.
</p>

<p>
This option may appear more than once.
</p>
</div>
</div>
<div id="outline-container-org3e51074" class="outline-4">
<h4 id="org3e51074"><span class="section-number-4">3.1.2.</span> Arguments and Values:</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<code>nickname</code> &#x2014; a <i>string designator</i>.
</p>

<p>
<code>package</code> &#x2014; a <i>package designator</i>.
</p>
</div>
</div>
<div id="outline-container-org2e54752" class="outline-4">
<h4 id="org2e54752"><span class="section-number-4">3.1.3.</span> Exceptional situations</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
An error of type <code>package-error</code> is signaled when a package designated by the
<code>package</code> does not exists.
</p>

<p>
Name conflict errors are handled by the underlying calls to
<code>add-package-local-nickname</code>.
</p>

<p>
See <a href="#exceptional-situations">add-package-local-nickname: exceptional situations</a>.
</p>
</div>
</div>
<div id="outline-container-org2c33bfa" class="outline-4">
<h4 id="org2c33bfa"><span class="section-number-4">3.1.4.</span> Implementation dependent</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
The consequences are undefined when a <i>local nickname</i> is specified for thex
package that is being defined. (See Issue 4.)
</p>

<p>
The consequences are undefined when supplied <i>local nicknames</i> are at variance
with the current state of the package. An implementation might choose to remove
all existing <i>local nicknames</i> at the beginning of each redefinition of the
package.
</p>
</div>
</div>
</div>
<div id="outline-container-make-package" class="outline-3">
<h3 id="make-package"><span class="section-number-3">3.2.</span> make-package</h3>
<div class="outline-text-3" id="text-make-package">
</div>
<div id="outline-container-orgad05ebe" class="outline-4">
<h4 id="orgad05ebe"><span class="section-number-4">3.2.1.</span> Description</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
(<b>Contains proposals</b>: see Issue 6.)
</p>

<p>
The <code>make-package</code> lambda list is extended to include an additional keyword
argument <code>:local-nicknames</code>:
</p>
<pre class="example">
local-nicknames ::= ((nickname package)*)
</pre>


<p>
<code>local-nicknames</code> specifies zero or more <i>local nicknames</i> to be defined in the
new <i>package</i>.
</p>
</div>
</div>
