export/spec.tex
% Created 2024-07-07 Sun 13:23
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: spec}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: spec},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec:org9e3b8a9}
This is a specification for the \texttt{Package-Local Nicknames} extension in Common Lisp.
\subsection{Rationale}
\label{sec:org52c15a0}
Package-local nicknames make it possible to use short and easy-to-use names
without potentially introducing name conflicts as can happen with usual nicknames.
\subsection{Current state}
\label{sec:orge0dc4e1}
Package-local nicknames are implemented in some form in \texttt{SBCL}, \texttt{CCL}, \texttt{ECL},
\texttt{Clasp}, \texttt{ABCL}, \texttt{Allegro CL}, \texttt{LispWorks}. There is also a pending MR for the
\texttt{CLISP} implementation.

Unfortunately, there are multiple inconsistencies between implementations. All of
them lose \emph{print-read consistency} to some extent, and there are multiple edge
cases that aren't always implemented correctly or in the same way.
\subsection{Goal}
\label{sec:org4088f74}
The purpose of this document is to standardize the \texttt{Package-Local Nicknames}
extension and to address some existing issues.

[TODO] This CDR also aims to provide an extensive test suite for the extension.
\section{Description}
\label{sec:org562c795}
A \emph{package-local nickname} (or a \emph{local nickname}) defined in some \emph{designated
package} has the same effects as a usual \emph{package nickname} (later referred to as a
\emph{global nickname}), except that these effects only apply when \texttt{*package*} is bound
to that \emph{designated package}.

This means that a call to \texttt{find-package} with a \emph{local nickname} that is defined in
the \emph{current package} returns the package nicknamed by this nickname. This also
affects all implied calls to \texttt{find-package}, including those performed by the Lisp
reader.

In addition, to maintain \emph{print-read consistency}, the Lisp printer is affected by
\emph{local nicknames} defined in the \emph{current package}.  For details see Issue 2.

A \emph{local nickname} is allowed to shadow a \emph{package name} or a \emph{global nickname},
except for the names \texttt{\#:CL}, \texttt{\#:COMMON-LISP} and \texttt{\#:KEYWORD} which must always
refer to their packages. The consequences of adding \emph{local nicknames} to the
packages \texttt{\#:COMMON-LISP} and \texttt{\#:KEYWORD} are also undefined.
\section{API}
\label{sec:org85a42da}
\subsection{defpackage}
\label{sec:org645e8ec}
\subsubsection{Description}
\label{sec:orga17c629}
The \texttt{defpackage} options are extended to include the \emph{local-nicknames-option}:
\begin{verbatim}
local-nicknames-option ::= (:local-nicknames (nickname package)*)
\end{verbatim}


Each pair specifies a \emph{local nickname} \texttt{nickname} for the corresponding \texttt{package}.

This option may appear more than once.
\subsubsection{Arguments and Values:}
\label{sec:org91ed076}
\texttt{nickname} --- a \emph{string designator}.

\texttt{package} --- a \emph{package designator}.
\subsubsection{Exceptional situations}
\label{sec:org87b6096}
An error of type \emph{package-error} is signaled when a package designated by the
\texttt{package} does not exist.

Name conflict errors are handled by the underlying calls to
\texttt{make-package} and \texttt{add-package-local-nickname}.
\subsubsection{Implementation dependent}
\label{sec:orgd97ee15}
The consequences are undefined when a \emph{local nickname} is specified for the
package that is being defined. (See Issue 4.)

The consequences are undefined when supplied \emph{local nicknames} are at variance
with the current state of the package. An implementation might choose to remove
all existing \emph{local nicknames} at the beginning of each redefinition of the
package.
\subsection{make-package}
\label{sec:org7d2b6a0}
\subsubsection{Description}
\label{sec:orgd7a24a6}
(\textbf{Contains proposals}: see Issue 6.)

The \texttt{make-package} lambda list is extended to include an additional keyword
argument \texttt{:local-nicknames}:
\begin{verbatim}
local-nicknames ::= ((nickname package)*)
\end{verbatim}


\texttt{local-nicknames} specifies zero or more \emph{local nicknames} to be defined in the
new \emph{package}.
