spec.org
*** Arguments and Values:
    ~local-nicknames~ --- a /list/ of pairs of form ~(nickname package)~.
    The default is an /empty list/.

    ~nickname~ --- a /string designator/.

    ~package~ --- a /package designator/.
*** Exceptional situations
    An error of type /package-error/ is signaled when a package designated by the
    ~package~ does not exist.

    If the ~nickname~ is one of the names ~#:CL~, ~#:COMMON-LISP~ or ~#:KEYWORD~, an
    error of type /package-error/ is signaled.

    If two or more local nicknames result in a name conflict, a /correctable/ error
    of type /package-error/ is signaled. A name conflict occurs when multiple local
    nicknames have same nicknames (equal by ~string=~) but different packages.

    A name conflict between multiple local nicknames may be resolved in favor of
    either nickname being defined.
*** Implementation dependent
    The consequences are undefined when a /local nickname/ is specified for the
    package that is being defined. (See [[#issue-4][Issue 4]].)
** add-package-local-nickname
   : (add-package-local-nickname nickname actual-package &optional designated-package)
   :   => designated-package-object
*** Arguments and Values
    ~nickname~ --- a /string designator/.

    ~actual-package~ --- a /package designator/.

    ~designated-package~ --- a /package designator/.
    The default is the /current package/.

    ~designated-package-object~ --- a /package/.
*** Description
    Defines a /package-local nickname/ ~nickname~ for the ~actual-package~ in the
    ~designated-package~.

    [Also see [[#issue-1][Issue 1]].] Returns the package designated by the ~designated-package~.

    If the /nickname/ is already defined, checks that it is defined for the package
    designated by the ~actual-package~.
*** Exceptional situations
    An error of type /package-error/ is signaled when a package designated by the
    ~actual-package~ or the ~designated-package~ does not exist.

    If the ~nickname~ is one of the names ~#:CL~, ~#:COMMON-LISP~ or ~#:KEYWORD~, an
    error of type /package-error/ is signaled.

    If the ~nickname~ is already defined to be a /local nickname/ for a package
    different from the ~actual-package~, a /correctable/ error of type /package-error/
    is signaled.
*** Implementation dependent
    The consequences are undefined when the ~designated-package~ designates the
    ~#:COMMON-LISP~ package or the ~#:KEYWORD~ package.

    (*Contains proposals*: see [[#issue-5][Issue 5]].)

    If the ~nickname~ shadows the /package name/ or one of the /global nicknames/ of
    the ~designated-package~, a style warning might be issued.
** remove-package-local-nickname
   : (remove-package-local-nickname old-nickname &optional designated-package)
   :   => nickname-removed-p
*** Arguments and Values
    ~old-nickname~ --- a /string designator/.

    ~designated-package~ --- a /package designator/.
    The default is the /current package/.

    ~nickname-removed-p~ --- /generalized boolean/.
*** Description
    If ~old-nickname~ is defined to be a /local nickname/ in the ~designated-package~,
    it is removed.

    [Also see [[#issue-1][Issue 1]].] Returns /true/ if it removes a nickname, and ~NIL~ otherwise.
*** Exceptional situations
    An error of type /package-error/ is signaled when a package designated by the
    ~designated-package~ does not exist.
** package-local-nicknames
   : (package-local-nicknames package-designator)
   :   => local-nicknames-alist
   : local-nicknames-alist ::= ((nickname . package)*)
*** Arguments and Values
    ~package-designator~ --- a /package designator/.

    ~local-nicknames-alist~ --- an /alist/.

    ~nickname~ --- a /string/.

    ~package~ --- a /package/.
