export/spec.html
<div id="outline-container-orgd71a168" class="outline-4">
<h4 id="orgd71a168"><span class="section-number-4">3.2.2.</span> Arguments and Values:</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
<code>local-nicknames</code> &#x2014; a <i>list</i> of pairs of form <code>(nickname package)</code>.
The default is an <i>empty list</i>.
</p>

<p>
<code>nickname</code> &#x2014; a <i>string designator</i>.
</p>

<p>
<code>package</code> &#x2014; a <i>package designator</i>.
</p>
</div>
</div>
<div id="outline-container-org385537e" class="outline-4">
<h4 id="org385537e"><span class="section-number-4">3.2.3.</span> Exceptional situations</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
An error of type <code>package-error</code> is signaled when a package designated by the
<code>package</code> does not exist.
</p>

<p>
Name conflict errors are handled by the underlying calls to
<code>add-package-local-nickname</code>.
</p>

<p>
See <a href="#exceptional-situations">add-package-local-nickname: exceptional situations</a>.
</p>
</div>
</div>
<div id="outline-container-org997bc26" class="outline-4">
<h4 id="org997bc26"><span class="section-number-4">3.2.4.</span> Implementation dependent</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
The consequences are undefined when a <i>local nickname</i> is specified for the
package that is being defined. (See Issue 4.)
</p>
</div>
</div>
</div>
<div id="outline-container-org2e3bf75" class="outline-3">
<h3 id="org2e3bf75"><span class="section-number-3">3.3.</span> add-package-local-nickname</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
(add-package-local-nickname nickname actual-package &amp;optional designated-package)
  =&gt; designated-package-object
</pre>
</div>
<div id="outline-container-orgf1d9ed0" class="outline-4">
<h4 id="orgf1d9ed0"><span class="section-number-4">3.3.1.</span> Arguments and Values</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
<code>nickname</code> &#x2014; a <i>string designator</i>.
</p>

<p>
<code>actual-package</code> &#x2014; a <i>package designator</i>.
</p>

<p>
<code>designated-package</code> &#x2014; a <i>package designator</i>.
The default is the <i>current package</i>.
</p>

<p>
<code>designated-package-object</code> &#x2014; a <i>package</i>.
</p>
</div>
</div>
<div id="outline-container-org44b776d" class="outline-4">
<h4 id="org44b776d"><span class="section-number-4">3.3.2.</span> Description</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Defines a <i>package-local nickname</i> <code>nickname</code> for the <code>actual-package</code> in the
<code>designated-package</code>.
</p>

<p>
[Also see Issue 1.] Returns the package designated by the <code>designated-package</code>.
</p>

<p>
If the <i>nickname</i> is already defined, checks that it is defined for the package
designated by the <code>actual-package</code>.
</p>
</div>
</div>
<div id="outline-container-exceptional-situations" class="outline-4">
<h4 id="exceptional-situations"><span class="section-number-4">3.3.3.</span> Exceptional situations</h4>
<div class="outline-text-4" id="text-exceptional-situations">
<p>
An error of type <i>package-error</i> is signaled when a package designated by the
<code>actual-package</code> or the <code>designated-package</code> does not exist.
</p>

<p>
If the <code>nickname</code> is one of the names <code>#:CL</code>, <code>#:COMMON-LISP</code> or <code>#:KEYWORD</code>, an
error of type <i>package-error</i> is signaled.
</p>

<p>
If the <code>nickname</code> is already defined to be a <i>local nickname</i> for a package
different from the <code>actual-package</code>, a <i>correctable</i> error of type <i>package-error</i>
is signaled.
</p>
</div>
</div>
<div id="outline-container-orgb3986b8" class="outline-4">
<h4 id="orgb3986b8"><span class="section-number-4">3.3.4.</span> Implementation dependent</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
The consequences are undefined when the <code>designated-package</code> designates the
<code>#:COMMON-LISP</code> package or the <code>#:KEYWORD</code> package.
</p>

<p>
(<b>Contains proposals</b>: see Issue 5.)
</p>

<p>
If the <code>nickname</code> shadows the <i>package name</i> or one of the <i>global nicknames</i> of
the <code>designated-package</code>, a style warning might be issued.
</p>
</div>
</div>
</div>
<div id="outline-container-org4385785" class="outline-3">
<h3 id="org4385785"><span class="section-number-3">3.4.</span> remove-package-local-nickname</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
(remove-package-local-nickname old-nickname &amp;optional designated-package)
  =&gt; nickname-removed-p
</pre>
</div>
<div id="outline-container-orgd2af67c" class="outline-4">
<h4 id="orgd2af67c"><span class="section-number-4">3.4.1.</span> Arguments and Values</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
<code>old-nickname</code> &#x2014; a <i>string designator</i>.
</p>

<p>
<code>designated-package</code> &#x2014; a <i>package designator</i>.
The default is the <i>current package</i>.
</p>

<p>
<code>nickname-removed-p</code> &#x2014; <i>generalized boolean</i>.
</p>
</div>
</div>
<div id="outline-container-org447a1e8" class="outline-4">
<h4 id="org447a1e8"><span class="section-number-4">3.4.2.</span> Description</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
If <code>old-nickname</code> is defined to be a <i>local nickname</i> in the <code>designated-package</code>,
it is removed.
</p>

<p>
[Also see Issue 1.] Returns <i>true</i> if it removes a nickname, and <code>NIL</code> otherwise.
</p>
</div>
</div>
<div id="outline-container-orge3147d6" class="outline-4">
<h4 id="orge3147d6"><span class="section-number-4">3.4.3.</span> Exceptional situations</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
An error of type <i>package-error</i> is signaled when a package designated by the
<code>designated-package</code> does not exist.
</p>
</div>
</div>
</div>
<div id="outline-container-orge096cb2" class="outline-3">
<h3 id="orge096cb2"><span class="section-number-3">3.5.</span> package-local-nicknames</h3>
<div class="outline-text-3" id="text-3-5">
<pre class="example">
(package-local-nicknames package-designator)
  =&gt; local-nicknames-alist
local-nicknames-alist ::= ((nickname . package)*)
</pre>
</div>
<div id="outline-container-orgb61a66b" class="outline-4">
<h4 id="orgb61a66b"><span class="section-number-4">3.5.1.</span> Arguments and Values</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
<code>package-designator</code> &#x2014; a <i>package designator</i>.
</p>

<p>
<code>local-nicknames-alist</code> &#x2014; an <i>alist</i>.
</p>

<p>
<code>nickname</code> &#x2014; a <i>string</i>.
</p>

<p>
<code>package</code> &#x2014; a <i>package</i>.
</p>
</div>
</div>
