spec.org
*** Description
    Returns an /alist/ describing /local nicknames/ defined in the package designated
    by the ~package-designator~.
*** Exceptional situations
    An error of type ~package-error~ is signaled when a package designated by the
    ~package-designator~ does not exist.
*** Notes
    The returned /alist/ must be safe to be modified by the user.
** package-locally-nicknamed-by-list
   : (package-locally-nicknamed-by-list package-designator)
   :   => packages-list
*** Arguments and Values
    ~package-designator~ --- a /package designator/.

    ~packages-list~ --- a /list/ of /package/ objects.
*** Description
    Returns a /list/ of packages that have a /local nickname/ defined for the package
    designated by the ~package-designator~.
*** Exceptional situations
    An error of type ~package-error~ is signaled when a package designated by the
    ~package-designator~ does not exist.
*** Notes
    The returned /list/ must be safe to be modified by the user.
* Affected symbols
** defpackage
   See [[#defpackage][defpackage]].
** make-package
   See [[#make-package][make-package]].
** find-package
   (*Contains proposals*: see [[#issue-3][Issue 3]], [[#issue-8][Issue 8]].)

   When the argument to ~find-package~ is a /local nickname/ defined in the /current
   package/, it returns the package nicknamed by this nickname.

   This also affects all implied calls to ~find-package~, including but not limited
   to those performed by the lisp reader as well as those performed by ~defpackage~,
   ~make-package~, ~export~, ~find-symbol~, ~import~, ~rename-package~, ~shadow~,
   ~shadowing-import~, ~delete-package~, ~with-package-iterator~, ~unexport~,
   ~unintern~, ~in-package~, ~unuse-package~, ~use-package~, ~do-symbols~,
   ~do-external-symbols~, ~do-all-symbols~, ~intern~, ~package-name~,
   ~package-nicknames~, ~package-shadowing-symbols~, ~package-use-list~,
   ~package-used-by-list~.

   ~add-package-local-nickname~, ~remove-package-local-nickname~,
   ~package-local-nicknames~ and ~package-locally-nicknamed-by~ are also affected.

   The only exception is the /tilde slash/ directive of ~format~, which should *not*
   use /local nicknames/ from any package when looking up the specified symbol.
** rename-package
   When a package is renamed with ~rename-package~, it retains all /local nicknames/
   it has defined, as well as all /local nicknames/ by which it is nicknamed.

*** Implementation dependent
    (*Contains proposals*: see [[#issue-5][Issue 5]].)

    If the /new-name/ or one of the /new-nicknames/ is shadowed by one of the /local
    nicknames/ of the package being renamed, a style warning might be issued.
** delete-package
   When a package is deleted with ~delete-package~, all /local nicknames/ defined in
   that package are removed, as well as all /local nicknames/ by which it is
   nicknamed.

   This also means that a deleted package must not be available via calls to
   ~package-locally-nicknamed-by-list~ and ~package-local-nicknames~.
** format
   See [[#issue-8][Issue 8]].
** \*features\*
    If an implementation supports package-local nicknames, it should add symbols
    ~:package-local-nicknames~ and ~:cdr-NN~ (per CDR 14) to ~*features*~.
* Examples
  [TODO]
