export/spec.html
<div id="outline-container-org10e01dc" class="outline-4">
<h4 id="org10e01dc"><span class="section-number-4">3.5.2.</span> Description</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Returns an <i>alist</i> describing <i>local nicknames</i> defined in the package designated
by the <code>package-designator</code>.
</p>
</div>
</div>
<div id="outline-container-org95a8b2a" class="outline-4">
<h4 id="org95a8b2a"><span class="section-number-4">3.5.3.</span> Exceptional situations</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
An error of type <code>package-error</code> is signaled when a package designated by the
<code>package-designator</code> does not exist.
</p>
</div>
</div>
<div id="outline-container-org8a7294d" class="outline-4">
<h4 id="org8a7294d"><span class="section-number-4">3.5.4.</span> Notes</h4>
<div class="outline-text-4" id="text-3-5-4">
<p>
The returned <i>alist</i> must be safe to be modified by the user.
</p>
</div>
</div>
</div>
<div id="outline-container-orgabb439c" class="outline-3">
<h3 id="orgabb439c"><span class="section-number-3">3.6.</span> package-locally-nicknamed-by-list</h3>
<div class="outline-text-3" id="text-3-6">
<pre class="example">
(package-locally-nicknamed-by-list package-designator)
  =&gt; packages-list
</pre>
</div>
<div id="outline-container-org96bb385" class="outline-4">
<h4 id="org96bb385"><span class="section-number-4">3.6.1.</span> Arguments and Values</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
<code>package-designator</code> &#x2014; a <i>package designator</i>.
</p>

<p>
<code>packages-list</code> &#x2014; a <i>list</i> of <i>package</i> objects.
</p>
</div>
</div>
<div id="outline-container-org78e01e2" class="outline-4">
<h4 id="org78e01e2"><span class="section-number-4">3.6.2.</span> Description</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
Returns a <i>list</i> of packages that have a <i>local nickname</i> defined for the package
designated by the <code>package-designator</code>.
</p>
</div>
</div>
<div id="outline-container-orgfc2c35a" class="outline-4">
<h4 id="orgfc2c35a"><span class="section-number-4">3.6.3.</span> Exceptional situations</h4>
<div class="outline-text-4" id="text-3-6-3">
<p>
An error of type <code>package-error</code> is signaled when a package designated by the
<code>package-designator</code> does not exist.
</p>
</div>
</div>
<div id="outline-container-org76b37ea" class="outline-4">
<h4 id="org76b37ea"><span class="section-number-4">3.6.4.</span> Notes</h4>
<div class="outline-text-4" id="text-3-6-4">
<p>
The returned <i>list</i> must be safe to be modified by the user.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga285303" class="outline-2">
<h2 id="orga285303"><span class="section-number-2">4.</span> Affected symbols</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9069915" class="outline-3">
<h3 id="org9069915"><span class="section-number-3">4.1.</span> defpackage</h3>
<div class="outline-text-3" id="text-4-1">
<p>
See <a href="#defpackage">defpackage</a>.
</p>
</div>
</div>
<div id="outline-container-org5f5eb17" class="outline-3">
<h3 id="org5f5eb17"><span class="section-number-3">4.2.</span> make-package</h3>
<div class="outline-text-3" id="text-4-2">
<p>
See <a href="#make-package">make-package</a>.
</p>
</div>
</div>
<div id="outline-container-org8321c8f" class="outline-3">
<h3 id="org8321c8f"><span class="section-number-3">4.3.</span> find-package</h3>
<div class="outline-text-3" id="text-4-3">
<p>
(<b>Contains proposals</b>: see Issue 3, Issue 8.)
</p>

<p>
When the argument to <code>find-package</code> is a <i>local nickname</i> defined in the <i>current
package</i>, it returns the package nicknamed by this nickname.
</p>

<p>
This also affects all implied calls to <code>find-package</code>, including but not limited
to those performed by the lisp reader as well as those performed by <code>defpackage</code>,
<code>make-package</code>, <code>export</code>, <code>find-symbol</code>, <code>import</code>, <code>rename-package</code>, <code>shadow</code>,
<code>shadowing-import</code>, <code>delete-package</code>, <code>with-package-iterator</code>, <code>unexport</code>,
<code>unintern</code>, <code>in-package</code>, <code>unuse-package</code>, <code>use-package</code>, <code>do-symbols</code>,
<code>do-external-symbols</code>, <code>do-all-symbols</code>, <code>intern</code>, <code>package-name</code>,
<code>package-nicknames</code>, <code>package-shadowing-symbols</code>, <code>package-use-list</code>,
<code>package-used-by-list</code>.
</p>

<p>
<code>add-package-local-nickname</code>, <code>remove-package-local-nickname</code>,
<code>package-local-nicknames</code> and <code>package-locally-nicknamed-by</code> are also affected.
</p>

<p>
The only exception is the <i>tilde slash</i> directive of <code>format</code>, which should <b>not</b>
use <i>local nicknames</i> from any package when looking up the specified symbol.
</p>
</div>
</div>
<div id="outline-container-orgda984a1" class="outline-3">
<h3 id="orgda984a1"><span class="section-number-3">4.4.</span> rename-package</h3>
<div class="outline-text-3" id="text-4-4">
<p>
When a package is renamed with <code>rename-package</code>, it retains all <i>local nicknames</i>
it has defined, as well as all <i>local nicknames</i> by which it is nicknamed.
</p>
</div>

<div id="outline-container-org48dc481" class="outline-4">
<h4 id="org48dc481"><span class="section-number-4">4.4.1.</span> Implementation dependent</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
(<b>Contains proposals</b>: see Issue 5.)
</p>

<p>
If the <i>new-name</i> or one of the <i>new-nicknames</i> is shadowed by one of the <i>local
nicknames</i> of the package being renamed, a style warning might be issued.
</p>
</div>
</div>
</div>
<div id="outline-container-org60b6158" class="outline-3">
<h3 id="org60b6158"><span class="section-number-3">4.5.</span> delete-package</h3>
<div class="outline-text-3" id="text-4-5">
<p>
When a package is deleted with <code>delete-package</code>, all <i>local nicknames</i> defined in
that package are removed, as well as all <i>local nicknames</i> by which it is
nicknamed.
</p>

<p>
This also means that a deleted package must not be available via calls to
<code>package-locally-nicknamed-by-list</code> and <code>package-local-nicknames</code>.
</p>
</div>
</div>
<div id="outline-container-orgc755fa5" class="outline-3">
<h3 id="orgc755fa5"><span class="section-number-3">4.6.</span> format</h3>
<div class="outline-text-3" id="text-4-6">
<p>
See Issue 8.
</p>
</div>
</div>
<div id="outline-container-orge20b6e3" class="outline-3">
<h3 id="orge20b6e3"><span class="section-number-3">4.7.</span> \*features\*</h3>
<div class="outline-text-3" id="text-4-7">
<p>
If an implementation supports package-local nicknames, it should add symbols
<code>:package-local-nicknames</code> and <code>:cdr-NN</code> (per CDR 14) to <code>*features*</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orga80a96b" class="outline-2">
<h2 id="orga80a96b"><span class="section-number-2">5.</span> Examples</h2>
<div class="outline-text-2" id="text-5">
<p>
[TODO]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gleefre</p>
<p class="date">Created: 2024-07-06 Sat 13:21</p>
</div>
</body>
</html>
