export/spec.tex
\subsubsection{Description}
\label{sec:org463c123}
Returns an \emph{alist} describing \emph{local nicknames} defined in the package designated
by the \texttt{package-designator}.
\subsubsection{Exceptional situations}
\label{sec:orgf522285}
An error of type \emph{package-error} is signaled when a package designated by the
\texttt{package-designator} does not exist.
\subsubsection{Notes}
\label{sec:org03604f3}
The returned \emph{alist} must be safe to be modified by the user.
\subsection{package-locally-nicknamed-by-list}
\label{sec:org46c6eb5}
\begin{verbatim}
(package-locally-nicknamed-by-list package-designator)
  => packages-list
\end{verbatim}
\subsubsection{Arguments and Values}
\label{sec:org6a51bb1}
\texttt{package-designator} --- a \emph{package designator}.

\texttt{packages-list} --- a \emph{list} of \emph{package} objects.
\subsubsection{Description}
\label{sec:org7372d2b}
Returns a \emph{list} of packages that have a \emph{local nickname} defined for the package
designated by the \texttt{package-designator}.
\subsubsection{Exceptional situations}
\label{sec:org2d0313a}
An error of type \emph{package-error} is signaled when a package designated by the
\texttt{package-designator} does not exist.
\subsubsection{Notes}
\label{sec:org775e9ac}
The returned \emph{list} must be safe to be modified by the user.
\section{Affected symbols}
\label{sec:org2ed01d8}
\subsection{defpackage}
\label{sec:org99b0820}
See \hyperref[sec:org645e8ec]{defpackage}.
\subsection{make-package}
\label{sec:org2257b65}
See \hyperref[sec:org7d2b6a0]{make-package}.
\subsection{find-package}
\label{sec:org73129b5}
(\textbf{Contains proposals}: see Issue 3, Issue 8.)

When the argument to \texttt{find-package} is a \emph{local nickname} defined in the \emph{current
package}, it returns the package nicknamed by this nickname.

This also affects all implied calls to \texttt{find-package}, including but not limited
to those performed by the lisp reader as well as those performed by \texttt{defpackage},
\texttt{make-package}, \texttt{export}, \texttt{find-symbol}, \texttt{import}, \texttt{rename-package}, \texttt{shadow},
\texttt{shadowing-import}, \texttt{delete-package}, \texttt{with-package-iterator}, \texttt{unexport},
\texttt{unintern}, \texttt{in-package}, \texttt{unuse-package}, \texttt{use-package}, \texttt{do-symbols},
\texttt{do-external-symbols}, \texttt{do-all-symbols}, \texttt{intern}, \texttt{package-name},
\texttt{package-nicknames}, \texttt{package-shadowing-symbols}, \texttt{package-use-list},
\texttt{package-used-by-list}.

\texttt{add-package-local-nickname}, \texttt{remove-package-local-nickname},
\texttt{package-local-nicknames} and \texttt{package-locally-nicknamed-by} are also affected.

The only exception is the \emph{tilde slash} directive of \texttt{format}, which should \textbf{not}
use \emph{local nicknames} from any package when looking up the specified symbol.
\subsection{rename-package}
\label{sec:org1f33c8c}
When a package is renamed with \texttt{rename-package}, it retains all \emph{local nicknames}
it has defined, as well as all \emph{local nicknames} by which it is nicknamed.

\subsubsection{Implementation dependent}
\label{sec:orgb30e600}
(\textbf{Contains proposals}: see Issue 5.)

If the \emph{new-name} or one of the \emph{new-nicknames} is shadowed by one of the \emph{local
nicknames} of the package being renamed, a style warning might be issued.
\subsection{delete-package}
\label{sec:orgaffba7b}
When a package is deleted with \texttt{delete-package}, all \emph{local nicknames} defined in
that package are removed, as well as all \emph{local nicknames} by which it is
nicknamed.

This also means that a deleted package must not be available via calls to
\texttt{package-locally-nicknamed-by-list} and \texttt{package-local-nicknames}.
\subsection{format}
\label{sec:org854d277}
See Issue 8.
\subsection{$\backslash$*features$\backslash$*}
\label{sec:org228de46}
If an implementation supports package-local nicknames, it should add symbols
\texttt{:package-local-nicknames} and \texttt{:cdr-NN} (per CDR 14) to \texttt{*features*}.
\section{Examples}
\label{sec:org6afc40d}
[TODO]
\end{document}